[
  {
    "title": "Task Management Website",
    "description": "A responsive web application designed to simplify task management. Users can easily create, publish, and track tasks.",
    "listItems": [
      "Developed a responsive task management web application for users to create, publish, and track tasks.",
      "Designed an intuitive web front-end using Angular, JavaScript, and CSS.",
      "Created the REST server using Node JS with Express and MongoDB Atlas as database.", 
      "Created CURD operations for adding/editing/deleting tasks."
    ],
    "imageUrl": "images/taskm.png",
    "technology":"Angular JS, Node JS, Express, JavaScript, MongoDB",
    "period":"Jan-May / 2023",
    "path":"https://github.com/jsheng0722/INFO6150"
  },
  {
    "title": "Data Analysis Project in Python",
    "description": "Engaged in a comprehensive data analysis project aimed at extracting meaningful insights from large datasets using Python and Jupyter Lab. This project involved the application of various data science techniques to clean, analyze, and visualize data effectively.",
    "listItems": [
      "Utilized Pandas to clean and structure raw data into a more manageable format, ensuring high-quality data for analysis.",
      "Applied statistical analysis techniques to explore complex data sets and identify underlying patterns or anomalies.", 
      "Created compelling visualizations using Matplotlib and Seaborn to represent the data analytically and provide actionable insights.",
      "Developed models to predict trends and outcomes based on historical data, enhancing decision-making processes."
    ],
    "imageUrl": "images/ds.png",
    "technology":"Python, Jupyter Lab, Pandas, NumPy, Matplotlib, Seaborn",
    "period":"Jan-Apr / 2024",
    "path":"https://github.com/jsheng0722/INFO6105"
  },
  {
    "title": "Game Design",
    "description": "Designed and developed core elements of a third-person survival game, focusing on essential gameplay features and foundational components. The project involved creating character animations, implementing materials, designing UI interfaces, and crafting immersive maps.",
    "listItems": [
      "Developed and implemented realistic character animations, enhancing gameplay immersion and player experience.",
      "Created and applied materials to game objects, ensuring visual consistency and aesthetic appeal.",
      "Designed and implemented user-friendly UI interfaces to improve player interaction and navigation.",
      "Built and textured game maps, establishing the foundational environment for the survival game."
    ],
    "imageUrl": "images/gd.png",
    "technology": "Unreal Engine 5",
    "period": "Sep-Dec / 2024",
    "path": "https://github.com/jsheng0722/CSYE7270"
  }
]